deneyapkart/deneyapkart-arduino-core/boards.txt
##############################################################

deneyapkartv2.name=Deneyap Kart v2

deneyapkartv2.vid.0=0x303a
deneyapkartv2.pid.0=0x82EB

deneyapkartv2.bootloader.tool=esptool_py
deneyapkartv2.bootloader.tool.default=esptool_py

deneyapkartv2.upload.tool=esptool_py
deneyapkartv2.upload.tool.default=esptool_py
deneyapkartv2.upload.tool.network=esp_ota

deneyapkartv2.upload.maximum_size=1310720
deneyapkartv2.upload.maximum_data_size=327680
deneyapkartv2.upload.flags=
deneyapkartv2.upload.extra_flags=
deneyapkartv2.upload.use_1200bps_touch=false
deneyapkartv2.upload.wait_for_upload_port=false

deneyapkartv2.serial.disableDTR=false
deneyapkartv2.serial.disableRTS=false

deneyapkartv2.build.tarch=xtensa
deneyapkartv2.build.bootloader_addr=0x0
deneyapkartv2.build.target=esp32s3
deneyapkartv2.build.mcu=esp32s3
deneyapkartv2.build.core=esp32
deneyapkartv2.build.variant=deneyapkartv2
deneyapkartv2.build.board=DYDKV2

deneyapkartv2.build.usb_mode=1
deneyapkartv2.build.cdc_on_boot=1
deneyapkartv2.build.msc_on_boot=0
deneyapkartv2.build.dfu_on_boot=0
deneyapkartv2.build.f_cpu=240000000L
deneyapkartv2.build.flash_size=4MB
deneyapkartv2.build.flash_freq=80m
deneyapkartv2.build.flash_mode=dio
deneyapkartv2.build.boot=qio
deneyapkartv2.build.boot_freq=80m
deneyapkartv2.build.partitions=default
deneyapkartv2.build.defines=-DBOARD_HAS_PSRAM
deneyapkartv2.build.loop_core=
deneyapkartv2.build.event_core=
deneyapkartv2.build.psram_type=opi
deneyapkartv2.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
deneyapkartv2.menu.JTAGAdapter.default=Disabled
deneyapkartv2.menu.JTAGAdapter.default.build.copy_jtag_files=0
deneyapkartv2.menu.JTAGAdapter.builtin=Integrated USB JTAG
deneyapkartv2.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
deneyapkartv2.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
deneyapkartv2.menu.JTAGAdapter.external=FTDI Adapter
deneyapkartv2.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
deneyapkartv2.menu.JTAGAdapter.external.build.copy_jtag_files=1
deneyapkartv2.menu.JTAGAdapter.bridge=ESP USB Bridge
deneyapkartv2.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
deneyapkartv2.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

deneyapkartv2.menu.PSRAM.opi=OPI PSRAM
deneyapkartv2.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
deneyapkartv2.menu.PSRAM.opi.build.psram_type=opi
deneyapkartv2.menu.PSRAM.disabled=Disabled
deneyapkartv2.menu.PSRAM.disabled.build.defines=
deneyapkartv2.menu.PSRAM.disabled.build.psram_type=qspi

deneyapkartv2.menu.FlashMode.qio=QIO 80MHz
deneyapkartv2.menu.FlashMode.qio.build.flash_mode=dio
deneyapkartv2.menu.FlashMode.qio.build.boot=qio
deneyapkartv2.menu.FlashMode.qio.build.boot_freq=80m
deneyapkartv2.menu.FlashMode.qio.build.flash_freq=80m
deneyapkartv2.menu.FlashMode.qio120=QIO 120MHz
deneyapkartv2.menu.FlashMode.qio120.build.flash_mode=dio
deneyapkartv2.menu.FlashMode.qio120.build.boot=qio
deneyapkartv2.menu.FlashMode.qio120.build.boot_freq=120m
deneyapkartv2.menu.FlashMode.qio120.build.flash_freq=80m
deneyapkartv2.menu.FlashMode.dio=DIO 80MHz
deneyapkartv2.menu.FlashMode.dio.build.flash_mode=dio
deneyapkartv2.menu.FlashMode.dio.build.boot=dio
deneyapkartv2.menu.FlashMode.dio.build.boot_freq=80m
deneyapkartv2.menu.FlashMode.dio.build.flash_freq=80m
deneyapkartv2.menu.FlashMode.opi=OPI 80MHz
deneyapkartv2.menu.FlashMode.opi.build.flash_mode=dout
deneyapkartv2.menu.FlashMode.opi.build.boot=opi
deneyapkartv2.menu.FlashMode.opi.build.boot_freq=80m
deneyapkartv2.menu.FlashMode.opi.build.flash_freq=80m

deneyapkartv2.menu.FlashSize.4M=4MB (32Mb)
deneyapkartv2.menu.FlashSize.4M.build.flash_size=4MB

deneyapkartv2.menu.LoopCore.1=Core 1
deneyapkartv2.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
deneyapkartv2.menu.LoopCore.0=Core 0
deneyapkartv2.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

deneyapkartv2.menu.EventsCore.1=Core 1
deneyapkartv2.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
deneyapkartv2.menu.EventsCore.0=Core 0
deneyapkartv2.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

deneyapkartv2.menu.USBMode.hwcdc=Hardware CDC and JTAG
deneyapkartv2.menu.USBMode.hwcdc.build.usb_mode=1
deneyapkartv2.menu.USBMode.default=USB-OTG (TinyUSB)
deneyapkartv2.menu.USBMode.default.build.usb_mode=0

deneyapkartv2.menu.CDCOnBoot.cdc=Enabled
deneyapkartv2.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
deneyapkartv2.menu.CDCOnBoot.default=Disabled
deneyapkartv2.menu.CDCOnBoot.default.build.cdc_on_boot=0

deneyapkartv2.menu.MSCOnBoot.default=Disabled
deneyapkartv2.menu.MSCOnBoot.default.build.msc_on_boot=0
deneyapkartv2.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
deneyapkartv2.menu.MSCOnBoot.msc.build.msc_on_boot=1

deneyapkartv2.menu.DFUOnBoot.default=Disabled
deneyapkartv2.menu.DFUOnBoot.default.build.dfu_on_boot=0
deneyapkartv2.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
deneyapkartv2.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

deneyapkartv2.menu.UploadMode.default=UART0 / Hardware CDC
deneyapkartv2.menu.UploadMode.default.upload.use_1200bps_touch=false
deneyapkartv2.menu.UploadMode.default.upload.wait_for_upload_port=false
deneyapkartv2.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
deneyapkartv2.menu.UploadMode.cdc.upload.use_1200bps_touch=true
deneyapkartv2.menu.UploadMode.cdc.upload.wait_for_upload_port=true

deneyapkartv2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
deneyapkartv2.menu.PartitionScheme.default.build.partitions=default
deneyapkartv2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
deneyapkartv2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
deneyapkartv2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
deneyapkartv2.menu.PartitionScheme.minimal.build.partitions=minimal
deneyapkartv2.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
deneyapkartv2.menu.PartitionScheme.no_fs.build.partitions=no_fs
deneyapkartv2.menu.PartitionScheme.no_fs.upload.maximum_size=2031616
deneyapkartv2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
deneyapkartv2.menu.PartitionScheme.no_ota.build.partitions=no_ota
deneyapkartv2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
deneyapkartv2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
deneyapkartv2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
deneyapkartv2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
deneyapkartv2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
deneyapkartv2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
deneyapkartv2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
deneyapkartv2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
deneyapkartv2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
deneyapkartv2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
deneyapkartv2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
deneyapkartv2.menu.PartitionScheme.huge_app.build.partitions=huge_app
deneyapkartv2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
deneyapkartv2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
deneyapkartv2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
deneyapkartv2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
deneyapkartv2.menu.PartitionScheme.rainmaker=RainMaker 4MB
deneyapkartv2.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
deneyapkartv2.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
deneyapkartv2.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
deneyapkartv2.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
deneyapkartv2.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
deneyapkartv2.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
deneyapkartv2.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
deneyapkartv2.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
deneyapkartv2.menu.PartitionScheme.custom=Custom
deneyapkartv2.menu.PartitionScheme.custom.build.partitions=
deneyapkartv2.menu.PartitionScheme.custom.upload.maximum_size=16777216

deneyapkartv2.menu.CPUFreq.240=240MHz (WiFi)
deneyapkartv2.menu.CPUFreq.240.build.f_cpu=240000000L
deneyapkartv2.menu.CPUFreq.160=160MHz (WiFi)
deneyapkartv2.menu.CPUFreq.160.build.f_cpu=160000000L
deneyapkartv2.menu.CPUFreq.80=80MHz (WiFi)
deneyapkartv2.menu.CPUFreq.80.build.f_cpu=80000000L
deneyapkartv2.menu.CPUFreq.40=40MHz
deneyapkartv2.menu.CPUFreq.40.build.f_cpu=40000000L
deneyapkartv2.menu.CPUFreq.20=20MHz
deneyapkartv2.menu.CPUFreq.20.build.f_cpu=20000000L
deneyapkartv2.menu.CPUFreq.10=10MHz
deneyapkartv2.menu.CPUFreq.10.build.f_cpu=10000000L

deneyapkartv2.menu.UploadSpeed.921600=921600
deneyapkartv2.menu.UploadSpeed.921600.upload.speed=921600
deneyapkartv2.menu.UploadSpeed.115200=115200
deneyapkartv2.menu.UploadSpeed.115200.upload.speed=115200
deneyapkartv2.menu.UploadSpeed.256000.windows=256000
deneyapkartv2.menu.UploadSpeed.256000.upload.speed=256000
deneyapkartv2.menu.UploadSpeed.230400.windows.upload.speed=256000
deneyapkartv2.menu.UploadSpeed.230400=230400
deneyapkartv2.menu.UploadSpeed.230400.upload.speed=230400
deneyapkartv2.menu.UploadSpeed.460800.linux=460800
deneyapkartv2.menu.UploadSpeed.460800.macosx=460800
deneyapkartv2.menu.UploadSpeed.460800.upload.speed=460800
deneyapkartv2.menu.UploadSpeed.512000.windows=512000
deneyapkartv2.menu.UploadSpeed.512000.upload.speed=512000

deneyapkartv2.menu.DebugLevel.none=None
deneyapkartv2.menu.DebugLevel.none.build.code_debug=0
deneyapkartv2.menu.DebugLevel.error=Error
deneyapkartv2.menu.DebugLevel.error.build.code_debug=1
deneyapkartv2.menu.DebugLevel.warn=Warn
deneyapkartv2.menu.DebugLevel.warn.build.code_debug=2
deneyapkartv2.menu.DebugLevel.info=Info
deneyapkartv2.menu.DebugLevel.info.build.code_debug=3
deneyapkartv2.menu.DebugLevel.debug=Debug
deneyapkartv2.menu.DebugLevel.debug.build.code_debug=4
deneyapkartv2.menu.DebugLevel.verbose=Verbose
deneyapkartv2.menu.DebugLevel.verbose.build.code_debug=5

deneyapkartv2.menu.EraseFlash.none=Disabled
deneyapkartv2.menu.EraseFlash.none.upload.erase_cmd=
deneyapkartv2.menu.EraseFlash.all=Enabled
deneyapkartv2.menu.EraseFlash.all.upload.erase_cmd=-e

